index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-05-20 Thu 13:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Calculate electrical response induced by drifting charge</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Brett Viren" />
<link rel="stylesheet" type="text/css" href="https://brettviren.github.io/moo/other/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://brettviren.github.io/moo/other/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Calculate electrical response induced by drifting charge</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd25e5dc">Introduction</a></li>
<li><a href="#orgf6b8419">Install</a></li>
<li><a href="#org7cfb998">Usage</a></li>
<li><a href="#org7693be6">Documentation</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd25e5dc" class="outline-2">
<h2 id="orgd25e5dc">Introduction</h2>
<div class="outline-text-2" id="text-orgd25e5dc">
<p>
This package solves Laplace, initial value and other problems in order
to produce the current response on electrodes due to drifting of
nearby charge.
</p>

<p>
About the name: the core Laplace problems are solved in <code>pochoir</code> with
the finite-difference method (FDM).  The core operation of FDM is
sometimes described as a "stencil" convolution.  The name <i>pochoir</i>
describes a stencil-based art style.  No constraint is intended on
your personal <a href="https://www.google.com/search?q=pronounce+pochoir">pronunciation of "pochoir"</a>.
</p>
</div>
</div>

<div id="outline-container-orgf6b8419" class="outline-2">
<h2 id="orgf6b8419">Install</h2>
<div class="outline-text-2" id="text-orgf6b8419">
<p>
<code>pochoir</code> installs in the "usual Python way".  Use of <code>pip</code> and a Python
virtual environment is recommended.   
</p>

<pre class="example" id="org9b76b15">
python3 -m venv venv
source venv/bin/activiate
</pre>

<p>
Or maybe you prefer <code>direnv</code>
</p>

<pre class="example" id="org8558b10">
echo layout python3 &gt; .envrc
direnv allow
</pre>

<p>
To install the base support (no support for GPU, plots, config)
</p>

<pre class="example" id="org37a86a1">
pip install git+https://github.com/brettviren/pochoir.git@HEAD
</pre>

<p>
Or for development
</p>

<pre class="example" id="org2d7d21f">
git clone git@github.com:brettviren/pochoir.git
cd pochoir
pip install -e .
</pre>

<p>
A number of "extra" support is included mostly for PyTorch, numba, or
cupy to try to accelerate some bottlenecks on GPU or via
multiprocessing.
</p>

<pre class="example" id="org23c1f99">
pip install -e .[torch,cupy,numba,vtk,plots,hdf5]
</pre>

<p>
Additional setup and of course hardware may be needed to use the GPU
support.
</p>
</div>
</div>


<div id="outline-container-org7cfb998" class="outline-2">
<h2 id="org7cfb998">Usage</h2>
<div class="outline-text-2" id="text-org7cfb998">
<p>
The <code>pochoir</code> command line user interface provides online help:
</p>

<div class="org-src-container">
<pre class="src src-shell">pochoir
</pre>
</div>

<pre class="example" id="org68e5663">
Usage: pochoir [OPTIONS] COMMAND [ARGS]...

  pochoir command line interface

Options:
  -s, --store PATH     File for primary data storage (input and maybe output)
  -o, --outstore PATH  File for output (primary only input)
  --help               Show this message and exit.

Commands:
  bc-interp         Interpolate 2D solution into 3D boundary condition
  domain            Produce a "domain" and store it to the named dataset.
  drift             Calculate drift paths.
  example           Generate a boundary and initial array example (try...
  export-vtk-image  Export a dataset to a vtk file of same name
  fdm               Apply finite-difference method.
  gen               Generate initial and boundary value arrays from a...
  gencfg            Generate JSON configuration files from master file.
  grad              Calculate the gradient of a scalar field.
  induce            Calculate induced current.
  init              Initialize a problem with a shape file.
  ls                List the store store
  move-paths        Move paths along offset vector.
  plot-drift        Visualize 2D or 3D paths
  plot-image        Visualize a dataset as 2D image
  plot-mag          Plot magnitude of a vector field
  plot-quiver       Visualize a 2D or 3D vector field as a "quiver" plot.
  srdot             Apply Ramo theorem dot product.
  starts            Store "starting" points.
  velo              Calculate a velocity field from a potential field
  version           Print the version
</pre>

<p>
Of particular note, to avoid having to always provide the <code>-s/--store</code>
option one may set the store via an environment variable:
</p>

<pre class="example" id="orgbce8bfb">
export POCHOIR_STORE=/path/to/store
</pre>

<p>
Individual commands provide more details on their use:
</p>

<div class="org-src-container">
<pre class="src src-shell">pochoir fdm --help
</pre>
</div>

<pre class="example" id="orgd24abcb">
Usage: pochoir fdm [OPTIONS]

  Apply finite-difference method.

  Solve Laplace equation given initial/boundary value arrays to produce a
  scalar potential array.

Options:
  -i, --initial TEXT              Input initial value array
  -b, --boundary TEXT             Input the boundary array
  -e, --edges TEXT                Comma separated list of 'fixed' or
                                  'periodic' giving domain edge conditions

  --precision FLOAT               Finish when no changes larger than precision
  --epoch INTEGER                 Number of iterations before any check
  -n, --nepochs INTEGER           Limit number of epochs (def: one epoch)
  --engine [numpy|numba|torch|cupy|cumba]
                                  The FDM engine to use
  -P, --potential TEXT            Output array holding solution for potential
  -I, --increment TEXT            Output array holding increment (error) on
                                  the solution

  --help                          Show this message and exit.
</pre>
</div>
</div>


<div id="outline-container-org7693be6" class="outline-2">
<h2 id="org7693be6">Documentation</h2>
<div class="outline-text-2" id="text-org7693be6">
<p>
The <code>pochoir</code> command attempts to be simple and accessible.  However,
the calculation it performs is not trivial and has many steps.  A user
must understand these steps and what <code>pochoir</code> requires.
</p>

<p>
The documentation to describe these details is in development.  For
now see:
</p>

<ul class="org-ul">
<li><a href="./overview.html">./overview.html</a> gives a conceptual description of the steps that
<code>pochoir</code> calculates.</li>

<li><a href="./test/test-sandh2d.html">./test/test-sandh2d.html</a> a walk through of a full-chain solving a
simplified, purely 2D problem.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Brett Viren</p>
<p class="date">Created: 2021-05-20 Thu 13:19</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
